
const ABILITY_DATA = {
  "等級": ["レア", "エピック", "ユニーク", "レジェンダリー"],
  "等級短縮": ["レア", "エピ", "ユニ", "レジェ"],
  "昇級確率": [
    1, 0.02, 0.01, 0
  ],
  "ミラクルサーキュレーター昇級確率": [
    1, 0.3, 0.1, 0
  ],
  "オプション等級確率": [ // 2,3行目のオプション等級抽選率（サーキュレーターも同じ）
    null,
    [1, 0, 0, 0],
    [0.7, 0.3, 0, 0],
    [0, 0.85, 0.15, 0],
  ],
  "アドバンスオプション等級確率": [// アドバンスリセット用
    null, null, null,
    [0, 0.83, 0.15, 0.02],
  ],
  "リセットコスト": {
    "名誉": [8000, 11000, 16000],
    "メル": [0, 0, 0],
  },
  "アドバンスリセットコスト": {
    "名誉": [20000, 30000, 40000],
    "メル": ["2,000,000", "6,000,000", "15,000,000"].map(e => +e.replaceAll(",", "")),
  },
  "オプション": null
};
{
  let temp_p, temp_v;
  ABILITY_DATA.オプション = [
    [0, "未選択", null, "未選択", true, false,
      [0, 0, 0, 0],
      [
        [],
        [],
        [],
        [],
      ]
    ],
    [1, "攻撃力増加", null, "攻撃力+$1", true, false,
      temp_p = [0.0000000, 0.0185360, 0.0140850, 0.0231270],
      temp_v = [
        [],
        [[6, 0.4], [9, 0.5], [12, 0.1]],
        [[15, 0.2], [18, 0.55], [21, 0.25]],
        [[27, 0.6], [30, 0.4]]
      ]
    ],
    [2, "魔力増加", null, "魔力+$1", true, false,
      temp_p,
      temp_v
    ],
    [3, "ボスモンスターへの攻撃ダメージ%増加", "ボスダメージ%増加", "ボスダメージ+$1%", true, true,
      [0.0000000, 0.0000000, 0.0093900, 0.0231270],
      [
        [],
        [],
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]]
      ]
    ],
    [4, "状態異常にかかった対象を攻撃時ダメージ%増加", "状態異常ダメージ%増加", "状態異常ダメージ+$1%", true, true,
      [0.0302768, 0.0278040, 0.0187790, 0.0185010],
      [
        [[2, 0.75], [3, 0.25]],
        [[4, 0.4], [5, 0.6]],
        [[7, 0.75], [8, 0.25]],
        [[9, 0.4], [10, 0.6]]
      ]
    ],
    [5, "クリティカル率%増加", null, "クリティカル率+$1%", true, true,
      [0.0000000, 0.0092680, 0.0046950, 0.0046250],
      [
        [],
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]],
        [[25, 0.2], [26, 0.2], [27, 0.2], [28, 0.15], [29, 0.15], [30, 0.1]]
      ]
    ],
    [6, "バフスキルの持続時間%増加", "バフ持続時間%増加", "バフ持続時間+$1%", true, true,
      [0.0346020, 0.0139020, 0.0093900, 0.0092510],
      [
        [[7, 0.2], [8, 0.2], [9, 0.2], [10, 0.15], [12, 0.15], [13, 0.1]],
        [[19, 0.2], [20, 0.2], [22, 0.2], [23, 0.15], [24, 0.15], [25, 0.1]],
        [[32, 0.2], [33, 0.2], [34, 0.2], [35, 0.15], [37, 0.15], [38, 0.1]],
        [[44, 0.2], [45, 0.2], [47, 0.2], [48, 0.15], [49, 0.15], [50, 0.1]]
      ]
    ],
    [7, "スキル使用時%確率で再使用待機時間が未適用", "スキル使用時%でct無視", "スキル使用時 $1% でct無視", true, true,
      [0.0000000, 0.0000000, 0.0187790, 0.0185010],
      [
        [],
        [],
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]]
      ]
    ],
    [8, "パッシブスキルのレベルが1増加", null, "パッシブスキルレベル+1", true, false,
      [0.0000000, 0.0000000, 0.0000000, 0.0074010],
      [
        [],
        [],
        [],
        [[1, 1]]
      ]
    ],
    [9, "アイテムドロップ率%増加", null, "アイテムドロップ率+$1%", true, true,
      temp_p = [0.0346020, 0.0278040, 0.0187790, 0.0185010],
      temp_v = [
        [[3, 0.4], [4, 0.35], [5, 0.25]],
        [[8, 0.4], [9, 0.35], [10, 0.25]],
        [[13, 0.4], [14, 0.35], [15, 0.25]],
        [[18, 0.4], [19, 0.35], [20, 0.25]]
      ]
    ],
    [10, "メル獲得量%増加", null, "メル獲得量+$1%", true, true,
      temp_p,
      temp_v
    ],
    [11, "最大HP増加", null, "最大HP+$1", false, false,
      temp_p = [0.0371970, 0.0278040, 0.0234740, 0.0185010],
      temp_v = [
        [[75, 0.2], [90, 0.2], [105, 0.2], [120, 0.15], [135, 0.15], [150, 0.1]],
        [[225, 0.2], [240, 0.2], [255, 0.2], [270, 0.15], [285, 0.15], [300, 0.1]],
        [[375, 0.2], [390, 0.2], [405, 0.2], [420, 0.15], [435, 0.15], [450, 0.1]],
        [[525, 0.2], [540, 0.2], [555, 0.2], [570, 0.15], [585, 0.15], [600, 0.1]]
      ]
    ],
    [12, "最大MP増加", null, "最大MP+$1", false, false,
      temp_p,
      temp_v
    ],
    [13, "最大HP%増加", null, "最大HP+$1%", true, true,
      temp_p = [0.0000000, 0.0000000, 0.0187790, 0.0185010],
      temp_v = [
        [],
        [],
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]]
      ]
    ],
    [14, "最大MP%増加", null, "最大MP+$1%", false, true,
      temp_p,
      temp_v
    ],
    [15, "STR増加", null, "STR+$1", false, false,
      temp_p = [0.0389270, 0.0417050, 0.0422540, 0.0416280],
      temp_v = [
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]],
        [[25, 0.2], [26, 0.2], [27, 0.2], [28, 0.15], [29, 0.15], [30, 0.1]],
        [[35, 0.2], [36, 0.2], [37, 0.2], [38, 0.15], [39, 0.15], [40, 0.1]]
      ]
    ],
    [16, "DEX増加", null, "DEX+$1", false, false,
      temp_p,
      temp_v
    ],
    [17, "INT増加", null, "INT+$1", false, false,
      temp_p,
      temp_v
    ],
    [18, "LUK増加", null, "LUK+$1", false, false,
      temp_p,
      temp_v
    ],
    [19, "全ての能力値増加", null, "全ての能力値+$1", false, false,
      [0.0346020, 0.0278040, 0.0187790, 0.0185010],
      [
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]],
        [[25, 0.2], [26, 0.2], [27, 0.2], [28, 0.15], [29, 0.15], [30, 0.1]],
        [[35, 0.2], [36, 0.2], [37, 0.2], [38, 0.15], [39, 0.15], [40, 0.1]]
      ]
    ],
    [20, "STR、DEX増加", null, "STR+$1、DEX+$2", false, false,
      temp_p = [0.0389270, 0.0389250, 0.0375590, 0.0323770],
      temp_v = [
        [[5, 0.2], [6, 0.2], [7, 0.2], [8, 0.15], [9, 0.15], [10, 0.1]],
        [[15, 0.2], [16, 0.2], [17, 0.2], [18, 0.15], [19, 0.15], [20, 0.1]],
        [[25, 0.2], [26, 0.2], [27, 0.2], [28, 0.15], [29, 0.15], [30, 0.1]],
        [[35, 0.2], [36, 0.2], [37, 0.2], [38, 0.15], [39, 0.15], [40, 0.1]]
      ]
    ],
    [21, "STR、INT増加", null, "STR+$1、INT+$2", false, false,
      temp_p,
      temp_v
    ],
    [22, "STR、LUK増加", null, "STR+$1、LUK+$2", false, false,
      temp_p,
      temp_v
    ],
    [23, "DEX、STR増加", null, "DEX+$1、STR+$2", false, false,
      temp_p,
      temp_v
    ],
    [24, "DEX、INT増加", null, "DEX+$1、INT+$2", false, false,
      temp_p,
      temp_v
    ],
    [25, "DEX、LUK増加", null, "DEX+$1、LUK+$2", false, false,
      temp_p,
      temp_v
    ],
    [26, "INT、STR増加", null, "INT+$1、STR+$2", false, false,
      temp_p,
      temp_v
    ],
    [27, "INT、DEX増加", null, "INT+$1、DEX+$2", false, false,
      temp_p,
      temp_v
    ],
    [28, "INT、LUK増加", null, "INT+$1、LUK+$2", false, false,
      temp_p,
      temp_v
    ],
    [29, "LUK、STR増加", null, "LUK+$1、STR+$2", false, false,
      temp_p,
      temp_v
    ],
    [30, "LUK、DEX増加", null, "LUK+$1、DEX+$2", false, false,
      temp_p,
      temp_v
    ],
    [31, "LUK、INT増加", null, "LUK+$1、INT+$2", false, false,
      temp_p,
      temp_v
    ],
    [32, "APを直接投資したSTRのx%、DEX増加", "AP投資STRのx%、DEX増加", "APを直接投資したSTRの $1%、DEX増加", false, true,
      temp_p = [0.0259520, 0.0278040, 0.0281690, 0.0231270],
      temp_v = [
        [[2, 0.75], [3, 0.25]],
        [[4, 0.4], [5, 0.6]],
        [[7, 0.75], [8, 0.25]],
        [[9, 0.4], [10, 0.6]]
      ]
    ],
    [33, "APを直接投資したDEXのx%、STR増加", "AP投資DEXのx%、STR増加", "APを直接投資したDEXの $1%、STR増加", false, true,
      temp_p,
      temp_v
    ],
    [34, "APを直接投資したINTのx%、LUK増加", "AP投資INTのx%、LUK増加", "APを直接投資したINTの $1%、LUK増加", false, true,
      temp_p,
      temp_v
    ],
    [35, "APを直接投資したLUKのx%、DEX増加", "AP投資LUKのx%、INT増加", "APを直接投資したLUKの $1%、INT増加", false, true,
      temp_p,
      temp_v
    ],
    [36, "xレベルごとに攻撃力1増加", null, "$1レベルごとに攻撃力1増加", false, false,
      temp_p = [0.0000000, 0.0000000, 0.0000000, 0.0231270],
      temp_v = [
        [],
        [],
        [],
        [[16, 0.2], [14, 0.4], [12, 0.3], [10, 0.1]]
      ]
    ],
    [37, "xレベルごとに魔力1増加", null, "$1レベルごとに魔力1増加", false, false,
      temp_p,
      temp_v
    ],
    [38, "一般モンスター攻撃時ダメージ%増加", "一般ダメージ%増加", "一般モンスター攻撃時ダメージ+$1%", false, true,
      [0.0302768, 0.0278040, 0.0187790, 0.0185010],
      [
        [[2, 0.75], [3, 0.25]],
        [[4, 0.4], [5, 0.6]],
        [[7, 0.75], [8, 0.25]],
        [[9, 0.4], [10, 0.6]]
      ]
    ],
    [39, "防御力のx%分ダメージが増加する", "防御力のx%ダメージ増加", "防御力の $1% 分ダメージが増加する", false, true,
      [0.0000000, 0.0000000, 0.0187790, 0.0185010],
      [
        [],
        [],
        [[13, 0.2], [15, 0.2], [18, 0.2], [20, 0.15], [23, 0.15], [25, 0.1]],
        [[38, 0.2], [40, 0.2], [43, 0.2], [45, 0.15], [48, 0.15], [50, 0.1]]
      ]
    ],
    [40, "多数攻撃スキルの攻撃対象増加", null, "多数攻撃スキルの攻撃対象増加", false, false,
      [0.0000000, 0.0000000, 0.0000000, 0.0074010],
      [
        [],
        [],
        [],
        [[1, 1]]
      ]
    ],
    [41, "攻撃速度段階の増加", null, "攻撃速度段階の増加", true, false,
      [0.0000000, 0.0000000, 0.0000000, 0.0046250],
      [
        [],
        [],
        [],
        [[1, 1]]
      ]
    ]
  ] // end-オプション
}

class AbilityOption {
  static NUMS = 0;
  static GRADES = ABILITY_DATA["等級"];

  constructor(row) {
    const [
      id,
      name,
      shortName,
      replacementText,
      useful,
      percentage,
      appearanceProbability,
      values,
    ] = row;

    this.id = AbilityOption.NUMS++; // idは振り直す
    this.名前 = name;
    this.短縮名 = shortName;
    this.置換名 = replacementText;
    this.isUseful = useful;
    this.isPercentage = percentage;

    // 等級別の抽選率（数値問わず）
    this.等級別確率 = Object.fromEntries(
      AbilityOption.GRADES.map((grade, i) => [
        grade,
        appearanceProbability[i],
      ])
    );

    // 等級別の数値候補と確率のペア：{数値, 確率} 配列
    this.等級別候補 = Object.fromEntries(
      AbilityOption.GRADES.map((grade, i) => [
        grade,
        values[i].map(arr => ({ 数値: arr[0], 確率: arr[1] })),
      ])
    );
  }

  /**
   * 数値置換済みのテキストを取得する
   * 例: getText(30) → "攻撃力+30"
   *     getText(10, 20) → "STR+10、DEX+20"
   */
  getText(...values) {
    return this.置換名.replace(
      /\$(\d+)/g,
      (match, index) => {
        const value = values[Number(index) - 1];
        return value === undefined ? match : String(value);
      }
    );
  }
}

// IDからオプションを取得できる辞書
const ABILITY_LIST = Object.fromEntries(
  ABILITY_DATA["オプション"].map(row => {
    const ability = new AbilityOption(row);
    return [ability.id, ability]; // idは振り直す
  })
);